app/controllers/goals_controller.rb

SELECT * FROM "goals" WHERE ("goals".user_id = 1) ORDER BY goals.id DESC LIMIT 1
---
  def index
    @goal = current_user.goals.first

SELECT * FROM "goals" WHERE ("goals"."id" = 1 AND ("goals".user_id = 1))
---
  def show
    @goal = current_user.goals.find(params[:id])