app/controllers/runs_controller.rb

  def index
    @runs = current_user.runs.all(:order => 'created_at DESC')
    @goal = current_user.goals.first
---
SELECT * FROM "runs" WHERE ("runs".user_id = 1) ORDER BY created_at DESC
SELECT avg("runs".distance_comparison) AS avg_distance_comparison FROM "runs" WHERE ("runs".user_id = 1)
SELECT * FROM "goals" WHERE ("goals".user_id = 1) LIMIT 1
SELECT * FROM "runs" WHERE ("runs".user_id = 8) ORDER BY created_at ASC LIMIT 20

  def show
    @run = current_user.runs.find(params[:id])
---
SELECT * FROM "runs" WHERE ("runs"."id" = 1 AND ("runs".user_id = 1))

  def edit
    @run = current_user.runs.find(params[:id])
---
SELECT * FROM "runs" WHERE ("runs"."id" = 2 AND ("runs".user_id = 1))

  def create
    @run = current_user.runs.new(params[:run])
    @goal = current_user.goals.first
    @run.duration = @run.hours*3600 + @run.minutes*60 + @run.seconds
    @run.avgspeed = ((@run.distance/@run.duration)*3600).round(1)
    @run.note = 'Enter notes here'


    @run.distance_comparison = (((@run.distance-@goal.distance)/@goal.distance)*100).round(1)
    #@run.duration_comparison = (((@run.duration-@goal.duration)/@goal.duration)*100).round(1)
    @run.avgspeed_comparison = (((@run.avgspeed-@goal.avgspeed)/@goal.avgspeed)*100).round(1)
    @run.total_comparison = ((@run.distance_comparison+@run.avgspeed_comparison)/2).round(1)

	@run.save
---
SELECT * FROM "goals" WHERE ("goals".user_id = 1) LIMIT 1
SELECT * FROM "runs" WHERE ("runs".user_id = 1) ORDER BY created_at DESC LIMIT 20
SELECT avg("runs".distance_comparison) AS avg_distance_comparison FROM "runs" WHERE ("runs".user_id = 1)
INSERT INTO "runs" ("seconds", "duration", "created_at", "minutes", "duration_comparison", "updated_at", "total_comparison", "user_id", "note", "distance_comparison", "hours", "avgspeed", "avgspeed_comparison", "distance") VALUES(0, 72000.0, '2009-11-29 19:56:12', 0, NULL, '2009-11-29 19:56:12', -58.7, 1, 'Enter notes here', -20.0, 20, 0.4, -97.3, 8.0)

  def update
    @run = current_user.runs.find(params[:id])
    @goal = current_user.goals.first
    @run.duration = @run.hours*3600 + @run.minutes*60 + @run.seconds

    @run.avgspeed = ((@run.distance/@run.duration)*3600).round(1)

    @run.distance_comparison = (((@run.distance-@goal.distance)/@goal.distance)*100).round(1)
    #@run.duration_comparison = (((@run.duration-@goal.duration)/@goal.duration)*100).round(1)
    @run.avgspeed_comparison = (((@run.avgspeed-@goal.avgspeed)/@goal.avgspeed)*100).round(1)
    @run.total_comparison = ((@run.distance_comparison+@run.avgspeed_comparison)/2).round(1)

    respond_to do |format|
      if @run.save
---
SELECT * FROM "runs" WHERE ("runs"."id" = 2 AND ("runs".user_id = 1))
UPDATE "runs" SET "avgspeed" = 14.2, "updated_at" = '2009-11-22 22:07:52' WHERE "id" = 1

  def destroy
    @run = current_user.runs.find(params[:id])
    @run.destroy
---
SELECT * FROM "runs" WHERE ("runs"."id" = 1 AND ("runs".user_id = 1))
DELETE FROM "runs" WHERE "id" = 1

  def set_goal_distance
  	@goal = current_user.goals.first
	@goal.distance = params[:value]
	@goal.duration = @goal.hours*3600 + @goal.minutes*60 + @goal.seconds
    @goal.avgspeed = ((@goal.distance/@goal.duration)*3600).round(1)
	@goal.save
	@runs = current_user.runs.all
		for @run in @runs
		    @run.distance_comparison = (((@run.distance-@goal.distance)/@goal.distance)*100).round(1)
    		#@run.duration_comparison = (((@run.duration-@goal.duration)/@goal.duration)*100).round(1)
    		@run.avgspeed_comparison = (((@run.avgspeed-@goal.avgspeed)/@goal.avgspeed)*100).round(1)
    		@run.total_comparison = ((@run.distance_comparison+@run.avgspeed_comparison)/2).round(1)
    		@run.save
---
SELECT * FROM "goals" WHERE ("goals".user_id = 1) LIMIT 1
UPDATE "goals" SET "avgspeed" = 11.9, "updated_at" = '2009-11-22 22:15:18', "duration" = 2430, "seconds" = 30 WHERE "id" = 1
SELECT * FROM "runs" WHERE ("runs".user_id = 8) ORDER BY created_at DESC LIMIT 20
SELECT avg("runs".distance_comparison) AS avg_distance_comparison FROM "runs" WHERE ("runs".user_id = 1)
UPDATE "runs" SET "distance" = 12.0, "avgspeed" = 180.0, "updated_at" = '2009-12-05 22:00:23', "distance_comparison" = -40.0, "avgspeed_comparison" = 2300.0, "total_comparison" = 1130.0 WHERE "id" = 35

  def delete

    @run = current_user.runs.find(params[:id])
    @run.destroy
---
SELECT * FROM "runs" WHERE ("runs"."id" = 1 AND ("runs".user_id = 1))
DELETE FROM "runs" WHERE "id" = 1

  def set_run_distance
	@run = current_user.runs.find(params[:id])
	@goal = current_user.goals.first
---
SELECT * FROM "runs" WHERE ("runs"."id" = 3 AND ("runs".user_id = 1))
SELECT * FROM "goals" WHERE ("goals"."id" = 1)