app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
    if @user.errors.empty?
      self.current_user = @user

      redirect_back_or_default('/')
      flash[:notice] = "Thanks for signing up!"

   		#create default goal
   			@goal = current_user.goals.new #(params[:goal])
       		@goal.distance = 8
    		@goal.hours = 0
    		@goal.minutes = 40
    		@goal.seconds = 0
    		@goal.duration = @goal.hours*3600 + @goal.minutes*60 + @goal.seconds
    		@goal.avgspeed = ((@goal.distance/@goal.duration)*3600).round(1)
    		@goal.save
---
INSERT INTO "users" ("salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('40710798d493fb2a593645342680173273caa4a1', '2009-11-15 18:06:52', '58f5bcc92c797186eaec5a02cc7aeca31e5c7ed0', NULL, '2009-11-15 18:06:52', NULL, 'stefano', 'stefano.costantini@gmail.com')
INSERT INTO "goals" ("seconds", "duration", "pace_minutes", "created_at", "minutes", "updated_at", "user_id", "hours", "avgspeed", "distance", "pace_seconds") VALUES(0, NULL, NULL, '2009-11-15 20:04:52', 0, '2009-11-15 20:04:52', 16, 0, NULL, 0.0, NULL)

    		@run.avgspeed_comparison = (((@run.avgspeed-@goal.avgspeed)/@goal.avgspeed)*100).round(1)
    		@run.total_comparison = ((@run.distance_comparison+@run.avgspeed_comparison)/2).round(1)

    		@run.save
---
INSERT INTO "runs" ("seconds", "duration", "created_at", "minutes", "duration_comparison", "updated_at", "total_comparison", "user_id", "note", "distance_comparison", "hours", "avgspeed", "avgspeed_comparison", "distance") VALUES(0, 2400.0, '2009-12-06 21:26:39', 40, NULL, '2009-12-06 21:26:39', NULL, 4, NULL, NULL, 0, 12.0, NULL, 8.0)